Revit 2027 API
BuiltInFailures.MEPCalculationFailures.PumpPressureNotComputed Property
 The calculated pressure drop of this pump is not computed because the critical path is not a closed loop. Check to see if there are other pumps intended for use within a secondary/tertiary loop. Use the Add Separation tool to define the secondary/tertiary loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PumpPressureNotComputed { get; }
Public Shared ReadOnly Property PumpPressureNotComputed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PumpPressureNotComputed {
	FailureDefinitionId^ get ();
}
static member PumpPressureNotComputed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace